[
    {
        "titre": "Mon site professionnel",
        "cat": "Dev",
        "url": "/portfolio/site-vitrine-alexandre-baumann",
        "technologies": [
            "Nuxt",
            "Vue",
            "SCSS"
        ],
        "thumb": "/Site-AB.jpg",
        "topic": "Création de site internet",
        "abstract": "Site vitrine dédié à présenter mes prestations de développement web et SEO.",
        "resumeP1": "Ce site me présente comme <strong>développeur web</strong> et <strong>SEO</strong>, ainsi que les <strong>prestations</strong> que je peux réaliser. Il est codé en javascript avec <strong>Nuxt.js</strong>, framework basé sur Vue.js, permettant le Server Side Rendering (rendu côté serveur) et la génération de site statique.",
        "resumeP2": "Les fonctionnalites sont une <strong>modale</strong> et un <strong>formulaire de contact</strong>. La base de données, ne contenant que les éléments de mon porfolio, est un simple json.",
        "fonctionnalites": "",
        "difficultes": "",
        "interet": "5"
    },
    {
        "titre": "Alternative Hydrogène",
        "cat": "Dev",
        "url": "/portfolio/site-information-alternative-hydrogene",
        "technologies": [
            "Next",
            "React",
            "MongoDB",
            "Python"
        ],
        "thumb": "/alternative-hydrogene.jpg",
        "topic": [
            "Génération de site SEO",
            "Création de site internet"
        ],
        "abstract": "Site d'information de plusieurs centaines de pages sur l'hydrogène.",
        "resumeP1": "Ce <strong>site d'information</strong> de plusieurs centaines de pages a pour objet de présenter le secteur de l'hydrogène. Il a plusieurs typologies de pages: les entreprises, les matériaux, les piles à combustible ... Elles sont affichées et classées dans plusieurs boucles grâce à la base de données <strong>MongoDB</strong>.",
        "resumeP2": "Le projet est codé avec <strong>Next.js</strong>, un framework de React permettant le Server Side Rendering, et repose sur l'utilisation de <strong>Python</strong> pour générer le contenu avec OpenAI et gérer le netlinking.",
        "interet": "4"
    },
    {
        "titre": "Chemins de vie",
        "cat": "Dev",
        "url": "/portfolio/site-vitrine-chemins-de-vie",
        "technologies": [
            "Next",
            "React"
        ],
        "thumb": "/chemins-de-vie.jpg",
        "topic": [
            "Création de site internet"
        ],
        "abstract": "Site vitrine pour un masseur / sophrologue , à destination des particuliers et des entreprises.",
        "resumeP1": "Ce site vitrine présente les services d'un masseur - sophrologue à destination des particuliers et des entreprises. Il est codé avec <strong>Next.js</strong>, un framework de React permettant le Server Side Rendering.",
        "resumeP2": "Les fonctionnalités sont une <strong>modale</strong> et un <strong>formulaire de contact</strong>.",
        "interet": "2"
    },
    {
        "titre": "Kasa - formation OpenClassRooms",
        "cat": "Dev",
        "url": "/portfolio/front-end-kasa",
        "technologies": [
            "React"
        ],
        "thumb": "/kaza.jpg",
        "topic": [
            "Projet de formation"
        ],
        "abstract": "Intégration du front end pour un site projet de formation.",
        "resumeP1": "Le projet Kasa, pour la formation OpenClassRooms, consistait à intégrer une interface graphique et plusieurs fonctionnalités: une boucle, un élément collapse et un carousel.",
        "resumeP2": "Il nous a permis de nous familiariser avec React et la bibliothèque Express.",
        "interet": "2"
    },
    {
        "titre": "Mon vieux Grimoire - formation OpenClassRooms",
        "cat": "Dev",
        "url": "/portfolio/back-end-mon-vieux-grimoire",
        "technologies": [
            "Node",
            "Express"
        ],
        "thumb": "/vieux-grimoire.jpg",
        "topic": [
            "Projet de formation"
        ],
        "abstract": "Conception du backend d'un site tourné autour de la notation de livres.",
        "resumeP1": "Le projet Mon vieux Grimoire, pour la formation OpenClassRooms, consistait à développer le backend d'un site de notation de livres.",
        "resumeP2": "Il a fallu développer des routeurs, middleware et contrôleur, notamment pour gérer une authentification et la publication d'images optimisées.",
        "interet": "2"
    },
    {
        "titre": "Etude de marché SEO",
        "cat": "SEO",
        "url": "/portfolio/seo-isolation-etude-de-marche",
        "technologies": [
            "SEMrush"
        ],
        "thumb": "/isolation-personne.jpg",
        "topic": [
            "Etude de marché SEO"
        ],
        "abstract": "Etude globale du marché de l'isolation sur le web.",
        "resumeP1": "Il s'agit d'une étude globale de marché SEO, portant sur l'isolation (thermique ou phonique) et correspondant à une journée de travail.",
        "resumeP2": "J'y présente les principaux ensembles de mots-clés (matériaux, zones à isoler, techniques ..) et propose des stratégies pour 4 types d'entreprises.",
        "interet": "5"
    },
    {
        "titre": "Etude de marché et stratégie SEO",
        "cat": "SEO",
        "url": "/portfolio/seo-panneaux-pv-etude-de-marche-strat",
        "technologies": [
            "SEMrush"
        ],
        "thumb": "/panneaux-solaires-installation.webp",
        "topic": [
            "Etude de marché SEO",
            "Stratégie"
        ],
        "abstract": "Etude du marché SEO et stratégie pour un installateur de panneaux photovoltaïques.",
        "resumeP1": "Je fais une étude de marché SEO pour installateur de panneaux photovoltaïques et propose une stratégie et un plan de site.",
        "resumeP2": "J'y présente en détail les principaux ensembles de mots-clés, leur intérêt et leur facilité, ainsi que les concurrents.",
        "interet": "5"
    }
]